{"data":{"markdownRemark":{"html":"<ol>\n<li>JIRA Nedir?\n1.1.\tTanıtım\nJIRA Atlassian Inc. tarafından geliştirilen Proje ve Süreç Yönetim aracıdır. Bu araç şirketler tarafından hem iş akış süreçlerini takip etmek hemde müşterilerin veya kullanıcıların isteklerine, sorun ve hatalara çevik(agile) metodolojiler ile yanıt vermek amacıyla kullanılır. JIRA’nın sahip olduğu yoğunlukta olan kullanıcıları kurumsal düzeydeki destek, planlama, raporlama ve daha fazlasına ihtiyaç duyan çevik(agile) takımlardır.\n1.2.\tAmaçları\nJIRA’nın en temel amaçları:</li>\n<li>Sorun ve Hata Kayıtları,</li>\n<li>Sorun ve Hata Takibi,</li>\n<li>Gelişmiş Proje Yönetimi,</li>\n<li>Derinlemesine Çevik(Agile) Raporlama,</li>\n<li>Çevik(Agile) Yol Haritası Çıkarma,</li>\n<li>Koşu(Sprint) Planlaması.</li>\n</ol>\n<p>Şekil 1.1. Jira logosu\n1.3.\tArtıları/Eksileri\nArtıları</p>\n<ul>\n<li>+3000’den fazla uygulamaya entegre edilebilir.(Freshdesk, GitHub, GitLab, Zendesk, vb.)</li>\n<li>+1000’den fazla eklenti.</li>\n<li>Özelleştirilebilir İş Akışları</li>\n<li>Gelişmiş takım iç görüleri</li>\n<li>Raporlama Araçları\t</li>\n</ul>\n<p>Eksileri</p>\n<ul>\n<li>\n<p>Yeni başlayanlar için çok karışık</p>\n</li>\n<li>\n<p>Rakiplerine göre çok daha pahalı</p>\n<p>1.4.\tRakipleri\nJIRA şu an piyasada rakipsiz gibi gözükse de maddi olarak küçük ve orta ölçekli çoğu şirket için JIRA çok büyük maliyetlere sahip olabilmektedir. Bu nedenle JIRA’ya hem özellik özellik olarak yakın veya üstün ya da maddi olarak daha uygun olan rakipler piyasada günden güne çoğalmaktadır. Bunların başında Trello ve Intelij Idea’nın yeni duyurduğu YouTrack uygulamaları gelmektedir.</p>\n</li>\n<li>\n<p>JIRA Türleri Nelerdir?\nJIRA Software Cloud size hem kendi bulut(cloud) sunucuları üzerinde ya da sizin seçmiş olduğunuz bir bulut üzerinde işlemleri gerçekleştirebilme olanağı sağladığı gibi aynı zamanda JIRA Software Server ile size kendi sunucularınız üzerinde çalıştırabileceğiniz bir versiyonuda sunar. Eğer çok daha fazla özelleştirme ve detaylı işlemler yapmak istiyorsanız genellikle tercih edilen versiyonu JIRA Software Server’dır.</p>\n</li>\n<li>\n<p>JIRA Software Server Nasıl İndirilir ve Kurulur?\n<a href=\"https://www.atlassian.com/software/jira/download\">https://www.atlassian.com/software/jira/download</a> adresinden indirmek/kurmak istediğiniz sürümü(version) ve sunucunuza(kendi bilgisayarınız da olabilir) uygun olan özellikleri seçerek indirme işlemini başlatalım. Bu yazıda 30 günlük deneme versiyonu üzerinden anlatılacağı için tam sürüm performansında ya da özelliklerinin hepsinin aktif olmaması muhtemeldir. Bu yazı içerisinde indirilen JIRA Software sürümü(version) 7.12.3’tür. </p>\n</li>\n</ul>\n<p>Şekil 3.1. İndirme sayfası\nJIRA Software Server-Side kurarken gerekli olan gereksinimler:</p>\n<ul>\n<li>Java Runtime Environment ( genelde JIRA kurucu dosyası kendisi kurar ve ayarlamaları yapar)</li>\n<li>500MB – 1GB arası Java Heap hafızası değerlendirme aşamasında yeterlidir.</li>\n<li>Değerlendirme aşamasında JIRA H2 Veritabanı kullanır. Kurulum ile birlikte gelir.</li>\n<li>Güvenlik konusunda ise Symantec dışında bütün güvenlik uygulamalarına açıktır. Symantec programın çalışması esnasında performans düşüklüğüne yol açmaktadır.\nJIRA Software gereksinimleri hakkında daha detaylı bilgiler için: </li>\n<li><a href=\"https://confluence.atlassian.com/adminjiraserver/jira-applications-installation-requirements-938846826.html\">https://confluence.atlassian.com/adminjiraserver/jira-applications-installation-requirements-938846826.html</a>\nKurulum hakkında detaylı bilgiler için:</li>\n<li><a href=\"https://confluence.atlassian.com/adminjiraserver/installing-jira-applications-on-windows-938846835.html#InstallingJiraapplicationsonWindows-3.Choosesetupmethod\">https://confluence.atlassian.com/adminjiraserver/installing-jira-applications-on-windows-938846835.html#InstallingJiraapplicationsonWindows-3.Choosesetupmethod</a>\nKurulum aşamaları:</li>\n<li>İndirmiş olduğumuz çalıştırılabilir dosyayı yönetici olarak çalıştırın.</li>\n</ul>\n<p>Şekil 3.2. Kurulum ekranı</p>\n<p>Şekil 3.3. Kurulum tipi seçim ekranı</p>\n<p>Şekil 3.4. Hızlı kurulum özet ekranı\nExpress Install(Hızlı Yükleme) seçeneğini seçmeniz taktirde yukarıdaki gibi direkt bir şekilde yükleme aşamasına geçebilirsiniz.</p>\n<p>Şekil 3.5. Kurulum ekranı\nCustom Install(Özel Kurulum) seçeneğinin seçilmesi durumunda aşağıdaki işlemler gerçekşecektir.</p>\n<ol start=\"2\">\n<li>Aşamaları takip edin ve aşağıdaki seçenekleri dikkatlice seçin:</li>\n<li>Destination directory – JIRA’nın yükleneceği yer.</li>\n</ol>\n<p>Şekil 3.6. Özel kurulum ekranı kurulum konum seçim ekranı</p>\n<p>Şekil 3.7. Özel kurulum ana dizin seçim ekranı </p>\n<ol start=\"2\">\n<li>Home directory – Jiraya ait logların, arama indekslerinin ve dosyalarının tutulacağı yer.</li>\n</ol>\n<p>Şekil 3.8. Özel kurulum başlangıçta start edilecek menu dosyası seçim ekranı</p>\n<ol start=\"3\">\n<li>Select Start Menu Folder: Sunucu/Bilgisayarınız üzerinde kurulu olan uygulamardan hangisi için Jira’nın kısa yol oluşturmasını isterseniz onları seçiniz diyor JIRA olarak kalması önerilir.</li>\n</ol>\n<p>Şekil 3.9. Özel kurulum TCP ayarları ekranı</p>\n<ol start=\"4\">\n<li>TCP ports –Jira’nın çalıştırılacağı HTTP bağlantı ve kontrol portları. Aynı port üzerinde başka uygulamalar çalıştırmıyorsanız Genel(Default) ayarları kullanmanız önerilir.</li>\n</ol>\n<p>Ben normal ayarları kullanacağım için Port seçimi konusunda değişiklik yapmadım sizler ihtiyaçlarınıza göre Set custom value for HTTP and Control ports seçeneği ile Jira portlarını yeniden yapılandırabilirsiniz.</p>\n<p> Şekil 3.10. Özel kurulum servis olarak çalıştır ekranı</p>\n<ol start=\"5\">\n<li>Install as service – Bu opsiyon sadece Yönetici olarak çalıştırırsanız gözükecektir.</li>\n</ol>\n<p>Şekil 3.12. Özel kurulum özet ekranı\nÖzet ekranında yapmış olduğunuz seçimlerin özeti gözüküyor olacaktır. Bu bilgileri teyit ettiğiniz taktirde Install diyip yükleme işlemini başlatabilirsiniz.</p>\n<p>Şekil 3.13. Özel kurulum yükleme ekranı</p>\n<p>Şekil 3.14. Özel kurulum yükleme bitiş ekranı</p>\n<p>Şekil 3.15. Özel kurulum başlatma ekranı\nBu ekranlar sizi korkutmasın gereksinimlerde belirttiğimiz kurulum için gerekli olanların hazırlanması işlemleri gerçekleştirilmektedir.</p>\n<p>Şekil 3.15. Özel kurulum başlatma bitiş ekranı</p>\n<ol start=\"3\">\n<li>JIRA yükleme tamamlandıktan sonra tarayıcınızda başlatılacaktır.\nŞekil 3.16. Jira başlangıç konfigurasyon tipi seçim ekranı\nİlk açıldığında yukarıdaki ekranı görüyor olacaksınız. Jira için temel ayarlarınızı yapılandırmanızı istiyor sizden, isterseniz Setup it up for me ( Benim için yap) seçeneği ile otomatik yapılandırma yaparak hızlıca kullanmaya başlayabilirsiniz ya da I’ll set it up myself( Ben yapılandırırım) diyerek detaylıca özelleştirip düzenleme yaparak başlatabilirsiniz. Bu yazıda deneme(trial) sürüm üzerinde işlem yaptığımız için ilk seçeneği seçeceğim ve sağ alttaki mavi buton ile bir MyAtlassian ayarlaması yapacağım.</li>\n</ol>\n<p>Şekil 3.17. Jira değerlendirme kurulumu konfigurasyon ekranı</p>\n<p>Şekil 3.18. Jira değerlendirme kurulumu konfigurasyon ekranı<br>\nŞekil 3.19. Jira değerlendirme kurulumu konfigurasyonu hesap ayarları ekranı</p>\n<p>Şekil 3.20. Jira değerlendirme kurulumu başlangıç ekranı<br>\nŞekil 3.21. Jira değerlendirme kurulumu dil seçimi ekranı<br>\nŞekil 3.21. Jira değerlendirme kurulum ekranı\nYukarıdaki adımları hızlıca tamamladıktan sonra artık başlayabilir gibi duruyoruz. </p>\n<ol start=\"4\">\n<li>JIRA Nasıl Kullanılır?\n4.1.\tProje Oluşturma\nJira kurulumumuzu tamamladıktan sonra nihayetinde Welcome! Ekranına ulaşıyoruz ve ilk projemizi oluşturup özellikleri inceleyelim.</li>\n</ol>\n<p>Şekil 4.1. Jira hoş geldiniz ekranı</p>\n<ul>\n<li>See a project in action: örnek verilerle oluşturulmuş bir projeyi inceleyin.</li>\n<li>Create a new project: sıfırdan bir proje oluşturmak ve yönetmek için.</li>\n<li>Import from another tool:  daha önce kullandığınız sorun takip araçlarından aktarılmış verileri içeri aktar ve kullan.\nCreate a new project seçeneğini seçip gelen model üzerinden Kanban software development seçeneğini seçip ilk projemizi oluşturabiliriz. Temel açıklamaları yaptıktan sonra sizden projeniz için bir isim ve anahtar oluşturmanızı isteyecektir.  </li>\n</ul>\n<p>Şekil 4.2. Jira Kanban Board oluşturma\nŞekil 4.3. Jira Kanban Board\nVe karşınıza projenize ait proje detay sayfası gelecektir. Bu sayfa üzerinden User Story’lerinizi yönetebilir, Kanban tablonuzu güncelleyebilir, görevler atayabilir ve daha fazlasını kolayca gerçekleştirebiliyor olacaksınız.\nPeki bu tabloyu nasıl doldurabiliriz sorusunu ise üst menü üzerinde bulunan “Create” butonu ile gerçekleştiriyor olacağız.\n4.2.\tBir istek oluşturmak (Creating a Issue/Bug/Story/Task/Epic)\nŞekil 4.4. Jira Create Issue\nBu düğmeye bastığınızda karşınıza aşağıdaki gibi bir ekran gelecektir.</p>\n<p>Şekil 4.5. Jira Create Issue modeli\nGelen ekran üzerinden alanları isterlerine göre doldurduğunuz taktirde Create düğmesi ile devam edebiliriz.  Devam etmeden önce ekran üzerindeki önemli birkaç yeri açıklamak daha doğru bir kullanım için yeterli olacaktır. Configure Fields diyerek bu from ekranını geliştirebilirsiniz.\n4.2.1.\tIssue Type(Sorun Tipi)\nSorun tipi olarak kabaca çevirilebilir peki nedir?\nEpic\tJira tarafından otomatik oluşturulur ve silinmesi tavsiye edilmez. Issue Type olarak büyük ve önemli User Story’ler için kullanılır.\nStory\tJira tarafından otomatik oluşturulur ve silinmesi tavsiye edilmez. User storyler için kullanılır.\nTask\tYapılması gereken bir görev için oluşturulur.\nBug\tÜrünün işlevlerini bozan veya engelleyen bir problem için kullanılır.\nYukarıdaki 4 tipe ait bilgilere göre Sorun tipi oluşturmak projenin organizasyonunu kolaylaştıracağı gibi yukarıdaki tipler size yetersiz geliyor ise kendi istekleriniz doğrultusunda farklı tiplerde ekleyebilirsiniz.\n4.2.2.\tPriority(Önem/Öncelik)\nBildirmekte olduğunuz kayıt(issue) hakkındaki önem derecesi geliştirici ekip tarafından önceliğe alınmasına dair geliştiricilere ve ekiptekilere bilgi verir.  Nedir bu öncelikler derseniz aşağıdaki tablo üzerinde inceleyebiliriz.\nHighest\tBu sorun işleyişi durduracaktır.\nHigh\tİşleyişi durdurabilecek ciddi bir sorun.\nMedium\tİşleyişi etkileme potansiyeli bulunan bir sorun.\nLow\tKolayca atlatılabilinen küçük çaplı bir sorun.\nLowest\tKüçük ya da hiç etkisi olmayan önemsiz sorun.</p>\n<p>4.2.3.\tAssignee(Görevli)\nAçılan Issue eğer bir yönetici tarafından yönetiliyor ise bu Issue direkt olarak geliştiricilere atanabilir veya kişi görevi kendisine atayabilir. </p>\n<p>Şekil 4.6. Jira issue oluştururken kişiye atama</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Oluşturma adımlarını tamamladığınız ve “Create” düğmesi ile devam ettiğinizde aşağıdaki gibi Kanban tablonuza bir backlog olarak yeni gelen istek düşecektir.</code></pre></div>\n<p> Şekil 4.7. Oluşturulan isteğin tablo üzerindeki görüntüsü\nÜzerine tıkladığınızda ise sağda açılan pencere şu şekilde olacaktır ve bu pencere içerisinde detay bilgiler yer almaktadır. Bu bilgileri yine aynı panel üzerinden düzenleyebilirsiniz.\nBu noktadan sonra backloglarınızı sürükleyerek tablo üzerinde istediğiniz konumlara atayabilirsiniz.\nŞekil 4.8. Issue Detail Paneli</p>\n<p>Şekil 4.9. Tablo üzerinde isteğin farklı aşamalara taşınması\n4.3.\tTablo Yönetimi ve Kullanımı\nJira da bir tablo üzerinde kolayca işlerinizi veya yeni eklenen istekleri/sorunları bulmak, yönetmek istiyorsanız tablonun hemen üstünde yer alan “Quick Filters” özelliği ile isterseniz “Sadece Kendinize Ait Olayları” ya da “Yeni Güncellenenleri” bir tıklama ile görebilirsiniz.\nŞekil 4.10. Tablo Düğmesi \t\t\t\tŞekil 4.11. Tablo üzerindeki Quick Filters seçenekleri</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Tabloyu yönetmek ve yapılandırmak için tablonun içerisinde sağ üst kısımda bulunan düğmeden yapabilirsiniz.</code></pre></div>\n<ul>\n<li>Configure: Yapılandırma sayfasına yönlendirir bu sayfadan tablonuzun tüm ayarlarını yapılandırabilirsiniz.</li>\n<li>Copy: Tablonuzu kopyalar ve yeni bir tabloda açar.</li>\n<li>Create Board: Projenize yeni bir tablo eklemenizi sağlar bu tablo bir Scrum Tablosu ve ya Kanban Tablo olabilir.(Not: açtığınız tablo projeniz içerisindeki backlogları kullanmaktadır. Bir backlogu X tablosunda güncelleyip silerseniz Y tablosunda da aynı işlemler yapılır.)</li>\n<li>Show/Hide detail view: Backlog detaylarını göster/gizle.</li>\n<li>Expand all swimlanes: Bütün alanları genişlet.</li>\n<li>Collapse all swimlanes: Bütün alanları daralt.</li>\n<li>Hide epic labels: Epic etiketine sahip Issue’ların etiketlerini gizler.</li>\n<li>Print Cards: Kartları yazdırma aracına yönlendirir ve buradan seçtiğiniz kartı yazıcıdan çıkartacak şekilde düzenler.\nŞekil 4.12. Tablo ayarları menüsü\nConfiguration seçeneği seçildiği taktirde açılan sayfada solda bulunan menü üzerinden tablolarınızı yapılandırabilirsiniz.</li>\n<li>General: Genel sekmesi altında temel ayarlar bulunur.</li>\n<li>Columns: Tablonuzda bulunan “Backlog, Selected For Development, In Progress, Done” gibi alanların bulunduğu ve bu alanların hangi durumlarda nasıl işlevler göstereceklerinin belirlendiği, eklenip, çıkarılabildiği ve düzenlenebildiği bölümdür.</li>\n<li>Swimlanes: Yapılacak olan backloglara ait gruplandırma ayarlarını içerir.</li>\n<li>Quick Filters: Tablo üzerinde Issue’lara erişmek için özel olarak ayarlayabileceğiniz filtereleme bölümüdür.</li>\n<li>Card colours: Issue kartlarının renklerinin hangi koşula göre olacağını düzenleyebileceğiniz yerdir.</li>\n<li>Card Layout: Issue kartlarının şablonlarını düzenleyeceğiniz yerdir.</li>\n<li>Working  days:  Ekibinize dair çalışma günlerinizi ve bu günlerin detayları vardır.(Burndown chart gibi raporlama araçlarının takım iç görülerinizi doğru bir şekilde raporlaması için önemlidir.)</li>\n<li>Issue Detail View: Tablo üzerinde detayını görmek için seçtiğiniz backlog’a ait detayları yapılandırabileceğiniz yerdir.</li>\n</ul>\n<p>Şekil 4.13. Tablo ayarları sayfası\n4.3.1.\tTablo Özelleştirme\nTablo Yönetimi ve Yapılandırma kısmı içerisindeki “Columns” menu elemanı altında bulunan bölümden “Add Column” düğmesine tıklayıp uygun parametreleri girip “Add” deyip oluşturabilirsiniz.</p>\n<p>Şekil 4.14. Tabloya sütun ekleme\nŞekil 4.15. Tablonun yeni sütun eklenmiş hali\t </p>\n<ol start=\"5\">\n<li>Proje Yönetimi ve Yapılandırmaları\nProjenizi hızlı bir şekilde yönetmek ve kullanmak için proje detay sayfanız içerisinde solda yapışık bulunan hızlı erişim çubuğundaki:</li>\n<li>Board: projenize ait görüntülemek istediğiniz tabloyu seçmek için kullanılır.</li>\n<li>Kanban Board: Seçili tabloyu görüntüler.</li>\n<li>Releases: Sürüm yayınlama ve yönetim ekranını görüntüler.</li>\n<li>Reports: Projeye dair hızlı ve hazır şablonlarla veya özel biçimlerde raporlar oluşturabileceğiniz ekrandır.</li>\n<li>Issues: Sorunları/Istekleri daha detaylı görüp inceleyebileceğiniz yerdir.</li>\n<li>Components: Projenize ait alt dallanmalar, bileşenler veya projeleri yönetebileceğiniz ekrandır. Bu ekran üzerinden atamalar yaparak projenizi zenginleştirmenin yanı sıra daha küçük parçalar halinde yönetmenize imkan sağlar.</li>\n<li>Project Shortcuts: Projenize ait olan önemli linkleri diğer kullanıcılarla paylaşabileceğiniz hızlı erişim alanıdır.</li>\n<li>Project Settings: Projenizi daha kompakt bir şekilde yönetip yapılandırabileceğiniz ekrandır.</li>\n</ol>\n<p> Şekil 5.1. Proje içerisindeki seçili tablonun görüntülenmesi\nŞekil 5.2. Proje sürüm ekranı</p>\n<p>Şekil 5.3. Proje raporlama ekranı\nŞekil 5.4. Proje bileşenleri ekranı\nŞekil 5.5. Proje istek(issue) ekranı</p>\n<p>Şekil 5.6. Proje ait yer imi ekleme modeli</p>\n<p>Şekil 5.7. Proje yapılandırma ekranı</p>\n<ul>\n<li>Summary: Aslında bu kısım, farklı ekranlardan yapılan işlemlerin bir araya toplantığı, gerçekten özet niteliğinde bir ekrandır. Zira bu işlemleri Jira Administration kısmını kullanarak da gerçekleştirebilirsiniz.</li>\n<li>Details: Bu kısımda projenizin adı, key’i, varsa web adresi(URL), Proje tipi, proje kategorisi, avatarı, açıklaması, proje lideri, varsayılan olarak işlerin atanacağı kişi bilgisi gibi bilgiler değiştirilebilir. </li>\n<li>Re-index: Proje içerisinde çok fazla Issue olduğunda nadiren projelerin içerisinde yer alana arama alanlarının doğru çalışmadığı gözlemlendiği için gerekli durumlarda bu sorunların giderilmesi için proje veri tabanını yapılandırmak için indekslemelerin düzeltilmesi işleminin gerçekleştirilebileceği ekrandır.</li>\n<li>Delete Project: Oluşturduğumuz projeyi silmek için kullanabileceğimiz item. </li>\n<li>Issue Types: Issue’lara ait özelliklerin düzenlenebildiği yerdir.\no\tBug: Bu issue’ya ait workflowun düzenleneceği alanı barındırır.\no\tEpic: Bu issue’ya ait workflowun düzenleneceği alanı barındırır.\no\tStory: Bu issue’ya ait workflowun düzenleneceği alanı barındırır.\no\tSub-Task: Bu issue’ya ait workflowun düzenleneceği alanı barındırır.\no\tTask: Bu issue’ya ait workflowun düzenleneceği alanı barındırır.</li>\n<li>Workflows: Projemiz için bir iş akışı oluşturabilir, mevcut iş akışlarını düzenleyebilmemize olanak sağlayan ekrandır.</li>\n<li>Screens: Issue tipine göre ekranlardaki görünür alanlarla ilgili düzenlemeleri yapabileceğiniz yerdir. </li>\n<li>Fields: Yeni bir issue oluştururken doldurmamız istenen alanlara yeni bir alan eklemek istersek, bunu custom fields tanımlayarak yapabiliyoruz. Burada seçili proje için oluşturulacak issue’lardaki alanların güncellenmesi/yeni alan eklenmesi/çıkarılması vb. işlemler gerçekleştirilebilir.</li>\n<li>Priorities: Bir issue’nun önemiyle ilgili olarak belirtimde bulunduğunuz öncelikleri düzenleyebileceğiniz yerdir.</li>\n<li>Versions: Versiyonların tanımlandığı, açtığımız issue’larda bu versiyonların hangisinde geliştirme yapacağımızı ya da etkilenen versiyonları seçebiliriz. Aynı zamanda release ya da derleme işlemi gibi işlemler de yapabilirsiniz.</li>\n<li>Components: Projede geliştirilecek olan özellikleri daha küçük parçalara ayırarak bunların yönetilmesi görevini de başka bir kullanıcıya vermek üzere kullanılan bir özellik. Bileşenler eklenip, kaldırılabilir. Kaldırılırken, bileşen içerisinde açılmış olan issue’ları başka bir bileşene taşımamızı isteyecektir.</li>\n<li>Users and Roles: Projenizde görevli olmak üzere kullanıcıları/geliştiricileri rollerine göre ekleyip çıkartabileceğiniz alandır.</li>\n<li>Permissions: Projeye dahil olmuş kişilerin rollerinin izinlerini düzenleyebileceğiniz yerdir.</li>\n<li>Issue Security: Projeye ait issue seviyesinde bir güvenlik seviyesi belirleyerek, hangi kullanıcı grubu tarafından görüntülenebileceğini belirlemek için kullanılabilecek seçenektir. Öncelikle Güvenlik şeması, sonra güvenlik seviyesi tanımlamak ve kullanıcı ya da grupları eklemek gerekir.</li>\n<li>Notifications: Projedeki issue’ların üzerindeki her hangi bir değişiklik yapılması halinde kimlere ve hangi mail adresi üzerinden mail gönderileceğini değiştirebildiğimiz ekran. Bu ekran sayesinde her olay için, hangi kullanıcı gruplarına ya da hangi kullanıcıya mail gönderileceğini belirleyebiliriz.</li>\n<li>HipChat Integration: Şirket içi mesajlaşma uygulaması hipchat entegrasyonu için kullanılabilecek menü öğesi.</li>\n<li>Development tools: Geliştirme araçlarınızı Jiraya entegre edebileceğiniz ekrandır.</li>\n<li>Issue Collectors: Projenizle ilgili kullanıcılardan hızlı geri dönüşler(feedback) alabilmeniz için projenizin içerisine yerleştirebileceğiniz bir geri bildirim düğmesi oluşturmanıza yarar ve son kullanıcıların yaptığı geri bildirimleri direkt olarak Jira projenize aktarır.</li>\n<li>JIRA Yönetimi ve Kullanımı\nJirada hızlı erişim çubuğu olarak da adlandırabileceğimiz üst menü üzerinde bulunan bu 6 düğme üzerinden hızlıca doğru alanlara ulaşabilir ve işlerinizi gerçekleştirebilirsiniz.</li>\n</ul>\n<p>Şekil 6.1. Jira hızlı erişim çubuğu</p>\n<ul>\n<li>Dashboard: üzerinden projelere ait güncel verilere, size atanan issue’lara hızlıca ulaşabilir daha fazlası için ise Manage Dashboards diyerek daha detaylı bir karşılama ekranına sahip olabilirsiniz.</li>\n</ul>\n<p>Şekil 6.2. Dashboard açılır menüsü</p>\n<p>Şekil 6.3. Dashboard ekranı</p>\n<ul>\n<li>Projects: açılır menüsü üzerinden anlık projelerinize, şirketinizin bünyesinde bulunan ve oturum açmış herkese açık olan yazılım ve iş projelerine ulaşabilir, dışarıdan bir projeyi içeriye aktarabilir ya da yeni bir proje oluşturabilirsiniz.</li>\n</ul>\n<p>Şekil 6.4. Project açılır menüsü</p>\n<ul>\n<li>Issues: Hızlıca issue’lar arasında arama yapabilir, son aramalarınıza ulaşabilir, geçmişte görüntülediğiniz son issuelara hızlıca ulaşabilir, bir excel dosyasından issueları içeri aktarabilir, açtığınız issue’ları takip edebilir, size açılmış issueları görebilir, ve bu filtreleri özelleştirebileceğiniz ekranlara ulaşabileceğiniz menü elemanıdır.</li>\n</ul>\n<p>   Şekil 6.5. Issues açılır menüsü</p>\n<ul>\n<li>\n<p>Boards: Tablolar menü elamanı altında son görüntülemiş olduğunuz tablolar vardır. Tüm tabloları görüntüle dediğiniz taktirde daha önce ziyaret ettiğiniz/görüntülediğiniz tüm tabloların listesi sizleri karşılayacaktır.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\"> Şekil 6.6. Boards açılır menüsü</code></pre></div>\n</li>\n<li>\n<p>Create: Projeleriniz için Issue oluşturmanızı sağlayan modeli açar.</p>\n</li>\n</ul>\n<p>Şekil 6.7. Create elemanı</p>\n<p>Şekil 6.8. Jira hızlı erişim çubuğu</p>\n<ul>\n<li>Search: Issue’larınızı ya da projelerinizi hızlı bir şekilde arama yapabileceğiniz yerdir.</li>\n</ul>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Şekil 6.9. Arama elemanı</code></pre></div>\n<ul>\n<li>Feedback: Jira’nın geliştirilmesi için Jira geliştiricilerine notlar bırakabileceğiniz, geri dönüşte(feedback) bulunabileceğiniz düğmedir. Tıkladığınız da bir model açılır. Ayrıca bir Issue Collector örneğidir.\nŞekil 6.10. Feedback düğmesi</li>\n</ul>\n<ul>\n<li>Help: Atlassian tarafından Jira ürününü kullanan kullanıcılara yönelik hazırlanmış dökümanlara kolay ulaşım açısından sağlanmış menü aracıdır.</li>\n</ul>\n<p> Şekil 6.11. Yardım düğmesi</p>\n<ul>\n<li>Jira Administration: Jiranızı yönetmenizi sağlar ve çok detaylı bir şekilde işlemler gerçekleştirmenize yardımcı olur. Eğer yönetici(admin) değilseniz bu menü altında çok daha kısıtlı elemanlar görüyor olacaksınız. Jiranızı diğer CI-CD araçlarına entegre ederken bu menü üzerindeki elemanlar içerisinden Add-ons şeceneği ile devam edilir. Yönetici değilseniz, yöneticinize başvurarak bu tip olayların gerçekleştirilmesini sağlayabilirsiniz.</li>\n</ul>\n<p>Şekil 6.12. Yönetici düğmesi</p>\n<ul>\n<li>User:  Temel kullanıcı işlemlerinizin yanında hızlıca size ait ögeleri özelleştirebileceğiniz menü elemanıdır.</li>\n</ul>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">       Şekil 6.12. Kullanıcı düğmesi</code></pre></div>\n<ol start=\"7\">\n<li>Kurulum Esnasında Karşılaşılan Hatalar\nKurulum esnasında programı ilk defa Jirayı “localhost:8080” olarak tarayıcı da açarken aşağıdaki hata ile karşılaşmıştım.</li>\n</ol>\n<p>Atlassian Plugins - JavaScript libraries (com.atlassian.plugin.jslibs)</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Bu hata bilinen bir hata olmakla beraber kullanıcıların sunucu yada bilgisayarlarının ana dilinin Türkçe olarak ayarlanmış olmasından kaynaklı olduğu ortaya çıkması dahilinde</code></pre></div>\n<ol>\n<li>Jira’nızı yüklemiş olduğunuz konum içerisindeki \\Bin klasörünü açınız,</li>\n<li>içerisinde bulunan setenv.bat dosyasını Notepad ile açınız,</li>\n<li>dosya içerisindeki JVM<em>SUPPORT</em>RECOMMENDED_ARGS= yazan yeri bulunuz,</li>\n<li>aynı satırın devamına aşağıdaki parametreleri yapıştırabilirsiniz.</li>\n<li>kaydedip çıkınız.</li>\n</ol>\n<p>-Duser.language=en -Duser.country=US -Duser.variant=US -Duser.timezone=Asia/Istanbul</p>\n<p>Sorununuz çözülecektir. Daha fazlası için aşağıdaki iki bağlantı üzerinden devam edebilirsiniz:</p>\n<ul>\n<li><a href=\"https://community.atlassian.com/t5/Questions/Jira-7-1-0-server-startup-error/qaq-p/105310\">https://community.atlassian.com/t5/Questions/Jira-7-1-0-server-startup-error/qaq-p/105310</a> </li>\n<li><a href=\"https://confluence.atlassian.com/adminjiraserver071/setting-properties-and-options-on-startup-802593108.html?_ga=2.253043209.1640962369.1539560497-1424128957.1539417023\">https://confluence.atlassian.com/adminjiraserver071/setting-properties-and-options-on-startup-802593108.html?_ga=2.253043209.1640962369.1539560497-1424128957.1539417023</a> </li>\n</ul>\n<p>S O N </p>","frontmatter":{"title":"My first post"}}},"pageContext":{"pathSlug":"/first-post","prev":null,"next":{"frontmatter":{"path":"/second-post","title":"My second post","tags":["shit","chat"]}}}}